Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSpareCurrentValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId)
Gets the value of the apparent current parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idCurrentParameter:
One of 4 valid current parameters: RBS_ELEC_APPARENT_CURRENT_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEA_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEB_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEC_PARAM
Returns:
The value of the spare's current parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The current parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row/column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetSpareCurrentValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the apparent current parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idCurrentParameter:
One of 4 valid current parameters: RBS_ELEC_APPARENT_CURRENT_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEA_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEB_PARAM, RBS_ELEC_APPARENT_CURRENT_PHASEC_PARAM
value:
The value of the spare's current for the given parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The current parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row/column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.GetSpareLoadValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId)
Gets the value of the apparent load parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idLoadParameter:
One of 4 valid load parameters: RBS_ELEC_APPARENT_LOAD, RBS_ELEC_APPARENT_LOAD_PHASEA, RBS_ELEC_APPARENT_LOAD_PHASEB, RBS_ELEC_APPARENT_LOAD_PHASEC
Returns:
The value of the spare's load parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The load parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row/column combination does not represent a valid spare.
Since:
2013

Autodesk.Revit.DB.Electrical.PanelScheduleView.SetSpareLoadValue(System.Int32,System.Int32,Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the apparent load parameter for a spare
row:
A row where the valid spare is
column:
A column where the valid spare is
idLoadParameter:
One of 4 valid load parameters: RBS_ELEC_APPARENT_LOAD, RBS_ELEC_APPARENT_LOAD_PHASEA, RBS_ELEC_APPARENT_LOAD_PHASEB, RBS_ELEC_APPARENT_LOAD_PHASEC
value:
The value of the spare's load for the given parameter
Throws Autodesk.Revit.Exceptions.ArgumentException:
The load parameter id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The row/column combination does not represent a valid spare.
Since:
2013